[X2DownloadableContentInfo_AddedPartNames]

; these are examples.
; every entry consists of a
;     .*Template="TemplateName"
; and a
;     .*Name="DisplayString"
; without semicolons of course

; * can be Torso, Arms, Legs
; order is important. to not get confused, you should arrange them like this:
; failing to have one line registered (for whatever reason)
; results in ALL subsequent ones being shifted by one, so all parts after that will have the wrong name
; TL:DR it is CRUCIAL to always pair these entries
; parts that don't have entries at all, or have the .*Name Empty will get the old style "Torso 1" thing, for example

;---------------------------
;Torso
;---------------------------

.TorsoTemplate="MAJSAM_Torso_1_X_M"
.TorsoName="武士 无甲"

.TorsoTemplate="MAJSAM_Torso_1_R_M"
.TorsoName="武士 无甲"

.TorsoTemplate="MAJSAM_Torso_1_T_M"
.TorsoName="武士 无甲"

.TorsoTemplate="MAJSAM_Torso_1_S_M"
.TorsoName="武士 无甲"

-------------------------------------------------------------------------------------

.TorsoTemplate="MAJSAM_Torso_2_X_M"
.TorsoName="武士 铠甲"

.TorsoTemplate="MAJSAM_Torso_2_R_M"
.TorsoName="武士 铠甲"

.TorsoTemplate="MAJSAM_Torso_2_T_M"
.TorsoName="武士 铠甲"

.TorsoTemplate="MAJSAM_Torso_2_S_M"
.TorsoName="武士 铠甲"

-------------------------------------------------------------------------------------

.TorsoTemplate="MAJSAM_Torso_FullGarb_X_M"
.TorsoName="武士 全副武装"

.TorsoTemplate="MAJSAM_Torso_FullGarb_R_M"
.TorsoName="武士 全副武装"

.TorsoTemplate="MAJSAM_Torso_FullGarb_T_M"
.TorsoName="武士 全副武装"

.TorsoTemplate="MAJSAM_Torso_FullGarb_S_M"
.TorsoName="武士 全副武装"

;---------------------------
;Arms
;---------------------------

;.ArmsTemplate=""
;.ArmsName=""

;---------------------------
;Legs
;---------------------------

.LegsTemplate="SAM_Legs_1_X_M"
.LegsName="武士 下肢 裸足"

.LegsTemplate="SAM_Legs_1_R_M"
.LegsName="武士 下肢 裸足"

.LegsTemplate="SAM_Legs_1_T_M"
.LegsName="武士 下肢 裸足"

.LegsTemplate="SAM_Legs_1_S_M"
.LegsName="武士 下肢 裸足"

-------------------------------------------------------------------------------------

.LegsTemplate="SAM_Legs_2_X_M"
.LegsName="武士 下肢 木屐"

.LegsTemplate="SAM_Legs_2_R_M"
.LegsName="武士 下肢 木屐"

.LegsTemplate="SAM_Legs_2_T_M"
.LegsName="武士 下肢 木屐"

.LegsTemplate="SAM_Legs_2_S_M"
.LegsName="武士 下肢 木屐"

-------------------------------------------------------------------------------------

.LegsTemplate="SAM_Legs_3_X_M"
.LegsName="武士 全装 裸足"

.LegsTemplate="SAM_Legs_3_R_M"
.LegsName="武士 全装 裸足"

.LegsTemplate="SAM_Legs_3_T_M"
.LegsName="武士 全装 裸足"

.LegsTemplate="SAM_Legs_3_S_M"
.LegsName="武士 全装 裸足"

-------------------------------------------------------------------------------------

.LegsTemplate="SAM_Legs_4_X_M"
.LegsName="武士 全装 木屐"

.LegsTemplate="SAM_Legs_4_R_M"
.LegsName="武士 全装 木屐"

.LegsTemplate="SAM_Legs_4_T_M"
.LegsName="武士 全装 木屐"

.LegsTemplate="SAM_Legs_4_S_M"
.LegsName="武士 全装 木屐"